too1/nrf52-ble-pong-central/app_pong.c
#include "app_pong.h"
#include "app_display.h"
#include "math.h"
#include "state_manager.h"
#include "app_pong_image_manager.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

APP_TIMER_DEF(m_game_loop_timer_id);

static bool                         m_game_initialized = false;
static pong_callback_t              m_event_callback;

static state_mngr_t                 m_gamestate_mngr;

static pong_gamestate_t             m_gamestate;
static pong_global_control_state_t  m_global_control_state;

static pong_event_t                 m_pong_event;
static bool                         m_graphics_invalidate = true;

static uint8_t                      m_background_pic[MATRIX_PIXEL_WIDTH*MATRIX_PIXEL_HEIGHT*1];

static struct {uint32_t paddle_pos_end[2]; uint32_t ball_x; uint32_t ball_y; 
               uint32_t winning_player; bool game_over;} m_point_won_game_state;

static app_display_text_view_t      m_textview_get_ready = {"Get ready ..", 28, 1, CL_BLUE, ALIGNMENT_CENTRE};
static char * m_get_ready_string_list[] = {"Get ready", "Get ready", "press", "your", "buttons", ""};
static app_display_text_view_t      m_textview_p1_name   = {"", 1, 11, CL_BLUE, ALIGNMENT_LEFT};
static app_display_text_view_t      m_textview_p2_name   = {"", 55, 20, CL_BLUE, ALIGNMENT_RIGHT};
static app_display_text_view_t      m_textview_versus    = {"vs", 63, 12, CL_WHITE, ALIGNMENT_RIGHT};
static app_display_text_view_t      m_textview_countdown = {"0", 32, 14, CL_WHITE, ALIGNMENT_CENTRE};

static state_t  reset_game(void);
static state_t  reset_ball(uint32_t player_score_index);
static void     pong_start_dummy_tournament_round(void);

// "Private" functions
static void reset_player_button_pressed_state(void)
{
    for(int i = 0; i < PONG_NUM_PLAYERS; i++)
    {
        m_global_control_state.player[i].button_pressed = false;
    }
}

static void start_every_state(uint32_t new_state, bool clear_screen)
{
    reset_player_button_pressed_state();
    if(clear_screen)
    {
        app_display_clear_screen();
    }
    m_graphics_invalidate = true;
    app_display_text_view_invalidate_all();
}

static uint8_t get_random_number(void)
{
    uint8_t ret_val;
    sd_rand_application_vector_get(&ret_val, 1);
    return ret_val;
}

static int32_t get_int_sinus(uint32_t x, uint32_t xmax, int32_t out_min, int32_t out_max)
{
    return (int32_t)((sinf((float)x * 2*3.1415f / (float)xmax) + 1.0f) * 0.5f * (float)(out_max - out_min) + (float)out_min);
}

static void on_set_thingy_color(uint32_t thingy_index, uint32_t color)
{
    if(m_gamestate.player[thingy_index].connected_state == CONSTATE_ACTIVE)
    {
        m_pong_event.evt_type = PONG_EVENT_CON_SET_COLOR;
        m_pong_event.game_state = &m_gamestate;
        m_pong_event.params.con_set_color.color = color;
        m_pong_event.params.con_set_color.conn_handle = m_gamestate.player[thingy_index].con_handle;
        m_event_callback(&m_pong_event);
    }
}

static void play_sound(uint32_t con_index, pong_sound_sample_t sample_id)
{
    // Send event back to the application to play the sound
    m_pong_event.evt_type = PONG_EVENT_PLAY_SOUND;
    m_pong_event.game_state = &m_gamestate;
    m_pong_event.params.play_sound.controller_index = con_index;
    m_pong_event.params.play_sound.sample_id = sample_id;
    m_event_callback(&m_pong_event);
}

static void on_game_started()
{
    m_pong_event.evt_type = PONG_EVENT_GAME_STARTED;
    m_event_callback(&m_pong_event);
}

static void on_point_scored(uint8_t player_id)
{
    m_pong_event.evt_type = PONG_EVENT_POINT_SCORED;
    m_pong_event.params.point_scored.player_index = player_id;
    m_event_callback(&m_pong_event);
}

static void on_game_over(uint8_t player_id)
{
    m_pong_event.evt_type = PONG_EVENT_GAME_OVER;
    m_pong_event.params.game_over.winner_index = player_id;
    m_event_callback(&m_pong_event);
}

static state_t reset_ball(uint32_t player_scored_index)
{
    uint32_t winning_player = 0xFFFF;
    m_point_won_game_state.ball_x = m_gamestate.ball_pos_x;
    m_point_won_game_state.ball_y = m_gamestate.ball_pos_y;
    m_point_won_game_state.winning_player = player_scored_index;
    m_gamestate.pong_pos_x = LEVEL_SIZE_X / 2;
    m_gamestate.pong_pos_y = LEVEL_SIZE_Y / 2;
    m_gamestate.time_since_last_speed_increment = 0;
    m_gamestate.ball_pos_x = LEVEL_SIZE_X / 2;
    m_gamestate.ball_pos_y = LEVEL_SIZE_Y / 2;
    m_gamestate.ball_speed = PONG_BALL_START_SPEED;
    m_gamestate.ball_rotation = 0.0f;
    
    uint8_t rand = get_random_number();
    switch(player_scored_index)
    {
        case 0:
            m_gamestate.ball_direction = ((float)rand * PI / 2.0f / 255.0f) - (PI * 0.25f);
            break;
        case 1:
            m_gamestate.ball_direction = ((float)rand * PI / 2.0f / 255.0f) + (PI * 0.75f);
            break;  
        default:
            rand = (rand & ~0x20) | ((rand & 0x40) ? 0x20 : 0x00);
            m_gamestate.ball_direction = (float)rand * 2 * PI / 255.0f;
            break;
    }

    // Reduce the speed increase by one step, but make sure it doesn't go below 1
    m_gamestate.ball_speed_inc_factor /= PONG_BALL_SPEED_INC_AMOUNT;
    if(m_gamestate.ball_speed_inc_factor < 1.0f)
    {
        m_gamestate.ball_speed_inc_factor = 1.0f;
    }

    for(int i = 0; i < PONG_NUM_PLAYERS; i++)
    {
       if(m_gamestate.player[i].score >= PONG_SCORE_LIMIT)
       {
           winning_player = i;
           on_game_over((uint8_t)winning_player);
       }
    }

    if(player_scored_index != 0xFFFFFFFF)
    {
        m_point_won_game_state.game_over = (winning_player != 0xFFFF);
        return STATE_GAME_POINT_SCORED;
    }
    return STATE_INVALID;
}

static state_t reset_game(void)
{
    for(int i = 0; i < PONG_NUM_PLAYERS; i++)
    {
        m_gamestate.player[i].paddle_pos_y = LEVEL_SIZE_Y / 2;
        m_gamestate.player[i].score = 0;
    }    
    m_gamestate.ball_speed_inc_factor = 1.0f;
    return reset_ball(0xFFFFFFFF);
}

static bool check_paddle_y_intersect(uint32_t y, uint32_t paddle_y)
{
    bool return_val;
    uint32_t paddle_upper = paddle_y + PADDLE_HALFSIZE_Y;
    uint32_t paddle_lower = (paddle_y > PADDLE_HALFSIZE_Y) ? paddle_y - PADDLE_HALFSIZE_Y : 0;
    if(paddle_y < PADDLE_HALFSIZE_Y)
    {
        return_val = (y < paddle_upper);
    }
    else if(paddle_y > (LEVEL_SIZE_Y - PADDLE_HALFSIZE_Y))
    {
        return_val = (y > paddle_lower);
    }
    else
    {
        return_val = (y > paddle_lower && y < paddle_upper);
    }
    NRF_LOG_INFO("%s Ball y: %i, paddle y: %i (%i-%i)", return_val ? "Hit!" : "Miss", y, paddle_y, paddle_lower, paddle_upper);
    return return_val;
}

static state_t update_game_running(void)
{
    state_t next_state = STATE_INVALID;
    // Update pong position
    m_gamestate.ball_direction += (m_gamestate.ball_rotation * 0.01f / m_gamestate.ball_speed_inc_factor);
    m_gamestate.ball_rotation *= PONG_BALL_ROTATION_DECAY_FACTOR;
    m_gamestate.ball_pos_x += cosf(m_gamestate.ball_direction) * m_gamestate.ball_speed * m_gamestate.ball_speed_inc_factor;
    m_gamestate.ball_pos_y += sinf(m_gamestate.ball_direction) * m_gamestate.ball_speed * m_gamestate.ball_speed_inc_factor;
    m_gamestate.pong_pos_x = (int32_t)m_gamestate.ball_pos_x;
    m_gamestate.pong_pos_y = (int32_t)m_gamestate.ball_pos_y;
    
    // Check if the ball has reached one of the board edges
    if(m_gamestate.pong_pos_x > LEVEL_SIZE_X)
    {
        // Right edge hit. Check if paddle is in position
        if(check_paddle_y_intersect(m_gamestate.pong_pos_y, m_gamestate.player[1].paddle_pos_y))
        {
            m_gamestate.pong_pos_x = LEVEL_SIZE_X;
            m_gamestate.ball_direction = PI - m_gamestate.ball_direction;
            m_gamestate.ball_rotation += (float)m_gamestate.player[1].paddle_pos_y_delta * 0.05f;
            NRF_LOG_INFO("New ball rotation: %i", (int)(m_gamestate.ball_rotation * 1000.0f));
            play_sound(1, SOUND_SAMPLE_HIT);
        }
        else
        {
            // The ball missed. Increment score and reset ball
            play_sound(0, SOUND_SAMPLE_COLLECT_POINT_B);
            play_sound(1, SOUND_SAMPLE_EXPLOSION_B);
            on_point_scored(0);
            m_gamestate.player[0].score++;
            next_state = reset_ball(0);
        }
    }
    else if(m_gamestate.pong_pos_x < 0)
    {
        // Left edge hit. Check if the paddle is in position
        if(check_paddle_y_intersect(m_gamestate.pong_pos_y, m_gamestate.player[0].paddle_pos_y))
        {
            m_gamestate.pong_pos_x = 0;
            m_gamestate.ball_direction = PI - m_gamestate.ball_direction;
            m_gamestate.ball_rotation -= (float)m_gamestate.player[0].paddle_pos_y_delta * 0.05f;
            NRF_LOG_INFO("New ball rotation: %i", (int)(m_gamestate.ball_rotation * 1000.0f));
            play_sound(0, SOUND_SAMPLE_HIT);
        }
        else
        {
            // The ball missed. Increment score and reset ball
            play_sound(0, SOUND_SAMPLE_EXPLOSION_B);
            play_sound(1, SOUND_SAMPLE_COLLECT_POINT_B);
            on_point_scored(1);
            m_gamestate.player[1].score++;
            next_state = reset_ball(1);
        }     
    }

    if(m_gamestate.pong_pos_y > LEVEL_SIZE_Y)
    {
        m_gamestate.pong_pos_y = LEVEL_SIZE_Y;
        m_gamestate.ball_direction = 2.0f * PI - m_gamestate.ball_direction;

