too1/nrf52-ble-pong-central/app_pong.c
    }
    else if(m_gamestate.pong_pos_y < 0)
    {
        m_gamestate.pong_pos_y = 0;
        m_gamestate.ball_direction = 2.0f * PI - m_gamestate.ball_direction;
    } 
    
    // Update speed multiplier
    m_gamestate.time_since_last_speed_increment++;
    if(m_gamestate.time_since_last_speed_increment > (PONG_SPEED_INC_INTERVAL * GAME_LOOP_UPDATE_FREQ))
    {
        m_gamestate.time_since_last_speed_increment = 0;
        m_gamestate.ball_speed_inc_factor *= PONG_BALL_SPEED_INC_AMOUNT;
    }

    return next_state;
}

static void update_game_loop(void *p)
{
    // Update paddle positions based on game input, independent of state
    for(int i = 0; i < PONG_NUM_PLAYERS; i++)
    {
        m_gamestate.player[i].paddle_pos_y = m_global_control_state.player[i].paddle_x;
        m_gamestate.player[i].paddle_pos_y_delta = m_global_control_state.player[i].paddle_x_delta;
    }

    state_mngr_on_update(&m_gamestate_mngr);

    // Send event back
    m_pong_event.evt_type = PONG_EVENT_GAMESTATE_UPDATE;
    m_pong_event.game_state = &m_gamestate;
    m_event_callback(&m_pong_event);
}

void gs_waiting_for_players(state_mngr_t * context, state_ops_return_t * return_data)
{
    uint32_t blink_fast = (context->lifetime >> 3) % 2;
    uint32_t paddle1_color, paddle2_color;
    switch(context->current_op)
    {
        case STATE_OP_ENTER:
            start_every_state(context->current_state, true);
            break;

        case STATE_OP_UPDATE:
            if(m_global_control_state.player[0].button_pressed && m_global_control_state.player[1].button_pressed &&
               !m_global_control_state.mobile_app_connected)
            {
                pong_start_dummy_tournament_round();
            }
            break;

        case STATE_OP_DRAW:
            paddle1_color = (m_gamestate.player[0].connected_state == CONSTATE_DISCONNECTED) ? CL_RED : m_gamestate.player[0].color;
            if(m_gamestate.player[0].connected_state != CONSTATE_ACTIVE && blink_fast) paddle1_color = CL_BLACK;
            paddle2_color = (m_gamestate.player[1].connected_state == CONSTATE_DISCONNECTED) ? CL_RED : m_gamestate.player[1].color;
            if(m_gamestate.player[1].connected_state != CONSTATE_ACTIVE && blink_fast) paddle2_color = CL_BLACK;
            app_display_draw_paddles(16, 16, paddle1_color, paddle2_color, m_graphics_invalidate);
            app_display_draw_text("Waiting", 32, 2, CL_BLUE, ALIGNMENT_CENTRE);
            app_display_draw_text("for", 32, 11, CL_BLUE, ALIGNMENT_CENTRE);
            app_display_draw_text("players", 32, 20, CL_BLUE, ALIGNMENT_CENTRE);
            break;

        default:
            break;
    }
}

void gs_tournament_round_starting(state_mngr_t * context, state_ops_return_t * return_data)
{
    static uint32_t get_ready_text_index;
    uint32_t blink_fast = (context->lifetime >> 3) % 2;
    switch(context->current_op)
    {
        case STATE_OP_ENTER:
            start_every_state(context->current_state, true);
            get_ready_text_index = 0;
            return_data->go_to_state = reset_game();
            //app_display_draw_text(m_gamestate.player[0].name, 1, 11, m_gamestate.player[0].color, ALIGNMENT_LEFT);
            //app_display_draw_text("vs", 63, 12, CL_WHITE, ALIGNMENT_RIGHT);
            //app_display_draw_text(m_gamestate.player[1].name, 52,21, m_gamestate.player[1].color, ALIGNMENT_RIGHT);
            break;

        case STATE_OP_UPDATE:
            if(m_global_control_state.player[0].button_pressed && 
               m_global_control_state.player[1].button_pressed)
            {
                return_data->go_to_state = STATE_GAME_START_PREDELAY;
            }
            break;

        case STATE_OP_DRAW:
            if((context->lifetime % 50) == 0){
                app_display_draw_bmp232(0, 0, 32, 32, m_gamestate.player[0].profile_pic);
                app_display_draw_bmp232(32, 0, 32, 32, m_gamestate.player[1].profile_pic);
                app_display_text_view_set_text(&m_textview_get_ready, m_get_ready_string_list[get_ready_text_index++]);
                get_ready_text_index %= (sizeof(m_get_ready_string_list) / sizeof(m_get_ready_string_list[0]));
                app_display_text_view_draw_w_shadow(&m_textview_get_ready);
                if((context->lifetime % 100) == 0)
                {
                    app_display_text_view_invalidate_all();
                    app_display_text_view_draw_w_shadow(&m_textview_p1_name);
                    app_display_text_view_draw_w_shadow(&m_textview_p2_name);
                }
            }
            //app_display_text_view_draw(&m_textview_get_ready, false);
            
            //app_display_text_view_set_offset(&m_textview_p1_name, get_int_sinus(context->lifetime % 100, 100, 0, 10), 0);
            //app_display_text_view_set_color(&m_textview_p1_name, (m_gamestate.player[0].connected_state == CONSTATE_ACTIVE && m_global_control_state.player[0].button_pressed) || blink_fast ? m_gamestate.player[0].color : CL_BLACK);
            //app_display_text_view_draw(&m_textview_p1_name, false);
            //app_display_text_view_draw(&m_textview_versus, false);
            //app_display_text_view_set_offset(&m_textview_p2_name, get_int_sinus(context->lifetime % 140, 140, 0, 10), 0);
            //app_display_text_view_set_color(&m_textview_p2_name, (m_gamestate.player[1].connected_state == CONSTATE_ACTIVE && m_global_control_state.player[1].button_pressed) || blink_fast ? m_gamestate.player[1].color : CL_BLACK);
            //app_display_text_view_draw(&m_textview_p2_name, false);
            break;

        default:
            break;
    }
}

void gs_start_new_game(state_mngr_t * context, state_ops_return_t * return_data)
{
    switch(context->current_op)
    {
        case STATE_OP_ENTER:
            start_every_state(context->current_state, false);
            return_data->go_to_state = reset_game();
            break;

        case STATE_OP_UPDATE:
            return_data->go_to_state = STATE_GAME_START_PREDELAY;
            break;

        default:
            break;
    }
}

void gs_start_predelay(state_mngr_t * context, state_ops_return_t * return_data)
{
    static char tmp_countdown_text[16];
    switch(context->current_op)
    {
        case STATE_OP_ENTER:
            start_every_state(context->current_state, false);
            app_display_fade_to_black(0);
            //app_display_draw_square(4, 0, 56, 32, CL_BLACK);
            app_display_score_state(&m_gamestate);
            break;

