too1/nrf52-ble-pong-central/app_pong.c
        case STATE_OP_UPDATE:
            if(context->lifetime > (PONG_PREDELAY_TIME_S * GAME_LOOP_UPDATE_FREQ))
            {
                return_data->go_to_state = STATE_GAME_RUNNING;
            }
            break;

        case STATE_OP_DRAW:
            app_display_fade_to_black(32);
            app_display_draw_text("Get ready", 32, 2, CL_WHITE, ALIGNMENT_CENTRE);
            app_display_draw_square(29, 14, 6, 8, CL_BLACK);
            sprintf(tmp_countdown_text, "%i", PONG_PREDELAY_TIME_S - (context->lifetime / GAME_LOOP_UPDATE_FREQ));
            app_display_draw_text(tmp_countdown_text, 32, 13, CL_WHITE, ALIGNMENT_CENTRE);
            app_display_draw_paddles(m_gamestate.player[0].paddle_pos_y * 32 / LEVEL_SIZE_Y, m_gamestate.player[1].paddle_pos_y * 32 / LEVEL_SIZE_Y,
                                     m_gamestate.player[0].color, m_gamestate.player[1].color, m_graphics_invalidate);
            break;

        default:
            break;
    }
}

void gs_game_running(state_mngr_t * context, state_ops_return_t * return_data)
{
    switch(context->current_op)
    {
        case STATE_OP_ENTER:
            start_every_state(context->current_state, true);
            break;

        case STATE_OP_UPDATE:
            return_data->go_to_state = update_game_running();
            break;

        case STATE_OP_DRAW:
            app_display_draw_paddles(m_gamestate.player[0].paddle_pos_y * 32 / LEVEL_SIZE_Y, m_gamestate.player[1].paddle_pos_y * 32 / LEVEL_SIZE_Y,
                                     m_gamestate.player[0].color, m_gamestate.player[1].color, m_graphics_invalidate);
            app_display_score_state(&m_gamestate);
            app_display_draw_ball(m_gamestate.pong_pos_x * 58 / LEVEL_SIZE_X, m_gamestate.pong_pos_y * 30 / LEVEL_SIZE_Y);
            break;

        default:
            break;
    }
}

void gs_point_scored(state_mngr_t * context, state_ops_return_t * return_data)
{
    switch(context->current_op)
    {
        case STATE_OP_ENTER:
            start_every_state(context->current_state, true);
            m_point_won_game_state.paddle_pos_end[0] = m_gamestate.player[0].paddle_pos_y;
            m_point_won_game_state.paddle_pos_end[1] = m_gamestate.player[1].paddle_pos_y;
            break;

        case STATE_OP_UPDATE:
            if(context->lifetime > (PONG_POINT_SCORED_SHOW_TIME_S * GAME_LOOP_UPDATE_FREQ))
            {
                if(!m_point_won_game_state.game_over)
                {
                   return_data->go_to_state = STATE_GAME_START_PREDELAY;
                }
                else 
                {
                   return_data->go_to_state = STATE_GAME_SCORE_LIMIT_REACHED;
                }
            }
            break;

        case STATE_OP_DRAW:
            if(context->lifetime == 0)
            {
                app_display_draw_text("point to", 32, 2, CL_BLUE, ALIGNMENT_CENTRE);
                app_display_draw_text(m_gamestate.player[m_point_won_game_state.winning_player].name, 32, 8, 
                                      CL_WHITE, ALIGNMENT_CENTRE);
            }
            if((context->lifetime % 16) == 0)
            {
                app_display_draw_paddles(m_point_won_game_state.paddle_pos_end[0] * 32 / LEVEL_SIZE_Y, m_point_won_game_state.paddle_pos_end[1] * 32 / LEVEL_SIZE_Y,
                                     m_gamestate.player[0].color, m_gamestate.player[1].color, true);

                app_display_draw_ball(m_point_won_game_state.ball_x * 58 / LEVEL_SIZE_X, m_point_won_game_state.ball_y * 30 / LEVEL_SIZE_Y);
                app_display_score_state(&m_gamestate);
            }
            else if((context->lifetime % 16) == 8)
            {
                app_display_draw_square(0, 0, 6, 32, CL_BLACK);
                app_display_draw_square(58, 0, 6, 32, CL_BLACK);
                app_display_score_state(&m_gamestate);
            }
            break;

        default:
            break;
    }
}

void gs_score_limit_reached(state_mngr_t * context, state_ops_return_t * return_data)
{
    switch(context->current_op)
    {
        case STATE_OP_ENTER:
            start_every_state(context->current_state, true);
            //app_display_draw_text("GAME OVER", 32, 2, CL_YELLOW, ALIGNMENT_CENTRE);
            //app_display_score_state(&m_gamestate);
            app_display_draw_bmp232(0, 0, 64, 32, m_background_pic);
            break;

        case STATE_OP_UPDATE:
            // If both players press the button, start a new game
            if(m_global_control_state.player[0].button_pressed && m_global_control_state.player[1].button_pressed)
            {
                return_data->go_to_state = STATE_GAME_START_NEW_GAME;
            }
            break;

        default:
            break;
    }
}

// "Public" functions
uint32_t app_pong_init(pong_config_t *config)
{
    static state_ops_map_t state_ops_map[] = {{STATE_WAITING_FOR_PLAYERS, gs_waiting_for_players},
                                              {STATE_GAME_TOURNAMENT_ROUND_STARTING, gs_tournament_round_starting},
                                              {STATE_GAME_START_NEW_GAME, gs_start_new_game},
                                              {STATE_GAME_START_PREDELAY, gs_start_predelay},
                                              {STATE_GAME_RUNNING, gs_game_running},
                                              {STATE_GAME_POINT_SCORED, gs_point_scored},
                                              {STATE_GAME_SCORE_LIMIT_REACHED, gs_score_limit_reached}}; 
    
    if(config->event_handler == 0) return -1;
    m_event_callback = config->event_handler;
    m_game_initialized = true;

    state_mngr_init(&m_gamestate_mngr, state_ops_map, sizeof(state_ops_map)/sizeof(state_ops_map[0]));

    app_pong_image_init();

    app_display_text_view_add(&m_textview_get_ready);
    app_display_text_view_add(&m_textview_p1_name);
    app_display_text_view_add(&m_textview_p2_name);
    app_display_text_view_add(&m_textview_versus);

    app_timer_create(&m_game_loop_timer_id, APP_TIMER_MODE_REPEATED, update_game_loop);
    reset_game();
    for(int p = 0; p < 2; p++)
    {
        m_gamestate.player[p].connected_state = CONSTATE_DISCONNECTED;
        m_gamestate.player[p].profile_pic_loaded = 0;
    }
    m_gamestate.player[0].color = COLOR_RGB(255, 0, 0);
    m_gamestate.player[1].color = COLOR_RGB(0, 255, 0);
    m_global_control_state.mobile_app_connected = false;
    return 0;
}

uint32_t app_pong_start_game(void)
{
    if(!m_game_initialized) return -1;
    state_mngr_run_state(&m_gamestate_mngr, STATE_WAITING_FOR_PLAYERS);
    app_timer_start(m_game_loop_timer_id, APP_TIMER_TICKS(GAME_LOOP_UPDATE_MS), 0);
    return 0;
}

