too1/nrf52-ble-pong-central/app_pong.c
uint32_t app_pong_start_tournament_round(uint8_t *init_buffer, uint32_t init_buffer_length)
{
    static uint8_t player1_name_buf[17], player2_name_buf[17];
    int i;
    if(!m_game_initialized) return -1;
    if(!(m_gamestate_mngr.current_state == STATE_WAITING_FOR_PLAYERS || m_gamestate_mngr.current_state == STATE_GAME_SCORE_LIMIT_REACHED || m_gamestate_mngr.current_state == STATE_GAME_POINT_SCORED)) return -1;
    m_gamestate.player[0].color = (uint32_t)*init_buffer++ << 16 | 
                                  (uint32_t)*init_buffer++ << 8 | 
                                  (uint32_t)*init_buffer++;
    for(i = 0; i < 15; i++)
    {
        player1_name_buf[i] = *init_buffer;
        if(*init_buffer++ == 0) break;
    }
    player1_name_buf[i + 1] = 0;
    m_gamestate.player[0].name = player1_name_buf;
    on_set_thingy_color(0, m_gamestate.player[0].color);
    app_display_text_view_set_color(&m_textview_p1_name, m_gamestate.player[0].color);
    app_display_text_view_set_text(&m_textview_p1_name, m_gamestate.player[0].name);

    m_gamestate.player[1].color = (uint32_t)*init_buffer++ << 16 | 
                                  (uint32_t)*init_buffer++ << 8 | 
                                  (uint32_t)*init_buffer++;
    for(i = 0; i < 15; i++)
    {
        player2_name_buf[i] = *init_buffer;
        if(*init_buffer++ == 0) break;
    }
    player2_name_buf[i + 1] = 0;
    m_gamestate.player[1].name = player2_name_buf;
    on_set_thingy_color(1, m_gamestate.player[1].color);
    app_display_text_view_set_color(&m_textview_p2_name, m_gamestate.player[1].color);
    app_display_text_view_set_text(&m_textview_p2_name, m_gamestate.player[1].name);
    
    on_game_started();
    state_mngr_run_state(&m_gamestate_mngr, STATE_GAME_TOURNAMENT_ROUND_STARTING);
    return 0;
}

uint32_t app_pong_forward_data_dump(uint8_t *dump, uint32_t dump_length)
{
    static uint32_t counter = 0;
    static uint32_t index = 0;
    static pong_image_info_t new_image_received;
    uint16_t pic_width, pic_height;
    if(dump_length == 0) 
    {
        // New picture incoming
        index = dump[1];
        pic_width = dump[2] << 8 | dump[3];
        pic_height = dump[4] << 8 | dump[5];
        NRF_LOG_INFO("Picture starting. W %i, H %i", (int)pic_width, (int)pic_height);
        counter = 0;
    }
    else
    {
        if(index >= 0 && index <= 1)
        {
            memcpy(m_gamestate.player[index].profile_pic + counter, dump, dump_length);
            counter += dump_length;
            if(counter >= PLAYER_PROFILE_PIC_SIZE) 
            {
                m_gamestate.player[index].profile_pic_loaded = 1;
            }
        }
        else if(index == 2)
        {
            memcpy(m_background_pic + counter, dump, dump_length);
            counter += dump_length;
            if(counter >= (PLAYER_PROFILE_PIC_SIZE*2))
            {
                strcpy(new_image_received.img_name, "Test");
                new_image_received.img_type = 1;
                new_image_received.width = 64;
                new_image_received.height = 32;
                new_image_received.data_ptr = m_background_pic;
                app_pong_image_store(&new_image_received);
            }
            
        }

    }
}

static void pong_start_dummy_tournament_round(void)
{
    m_gamestate.player[0].color = 0xFF0000;
    m_gamestate.player[0].name = "Red";
    on_set_thingy_color(0, m_gamestate.player[0].color);
    app_display_text_view_set_color(&m_textview_p1_name, m_gamestate.player[0].color);
    app_display_text_view_set_text(&m_textview_p1_name, m_gamestate.player[0].name);
    m_gamestate.player[1].color = 0x00FF00;
    m_gamestate.player[1].name = "Green";
    on_set_thingy_color(1, m_gamestate.player[1].color);
    app_display_text_view_set_color(&m_textview_p2_name, m_gamestate.player[1].color);
    app_display_text_view_set_text(&m_textview_p2_name, m_gamestate.player[1].name);
    state_mngr_run_state(&m_gamestate_mngr, STATE_GAME_TOURNAMENT_ROUND_STARTING);    
}

pong_controller_state_t *app_pong_get_controller(uint32_t index)
{
    return &m_global_control_state.player[index];
}

void app_pong_controller_status_change(uint16_t conn_handle, controller_state_t state)
{
    switch(state)
    {
        case CONSTATE_DISCONNECTED:
            // Look for an existing player and assign the state to it
            for(int i = 0; i < PONG_NUM_PLAYERS; i++)
            {
               if(m_gamestate.player[i].con_handle == conn_handle)
               {
                   m_gamestate.player[i].connected_state = CONSTATE_DISCONNECTED;
                   m_gamestate.player[i].con_handle = 0xFFFF;
                   break;
               }                
            }
           
            // Stop the game if running
            if(m_gamestate_mngr.current_state != STATE_WAITING_FOR_PLAYERS)
            {
                state_mngr_run_state(&m_gamestate_mngr, STATE_WAITING_FOR_PLAYERS);
            }
            break;
            
        case CONSTATE_CONNECTED:
            // Look for a free player to assign the newly connected controller to
            for(int i = 0; i < PONG_NUM_PLAYERS; i++)
            {
               if(m_gamestate.player[i].connected_state == CONSTATE_DISCONNECTED)
               {
                   m_gamestate.player[i].connected_state = CONSTATE_CONNECTED;
                   m_gamestate.player[i].con_handle = conn_handle;
                   break;
               }
            }
            break;
            
        case CONSTATE_ACTIVE:
            // Look for an existing player and assign the state to
            for(int i = 0; i < PONG_NUM_PLAYERS; i++)
            {
               if(m_gamestate.player[i].connected_state == CONSTATE_CONNECTED &&
                  m_gamestate.player[i].con_handle == conn_handle)
               {
                   m_gamestate.player[i].connected_state = CONSTATE_ACTIVE;
                   
                   // Send a callback to update the color on the connected controller to the player color
                   on_set_thingy_color(i, m_gamestate.player[i].color);
                   break;
               }                
            }
            // Check if both players are active, and start the game if true
            if(m_gamestate.player[0].connected_state == CONSTATE_ACTIVE && 
               m_gamestate.player[1].connected_state == CONSTATE_ACTIVE)
            {
                //pong_start_dummy_tournament_round();
            }
            break;
    }
}

void app_pong_set_mobile_app_connected_state(bool connected)
{
    m_global_control_state.mobile_app_connected = connected;
}

pong_gamestate_t *app_pong_get_gamestate(void)
{
    return &m_gamestate;
}

void app_pong_draw_display(void)
{
    state_mngr_on_draw(&m_gamestate_mngr);
}